{
    "text" : "\n\n\n\n\n\n\n\nDETERMINISTIC MODELS\nIn deterministic models the conditions under which an experiment is carried out determine the exact outcome of the experiment. In deterministic mathematical models, the solution of a set of mathematical equations specifies the exact outcome of the experiment. Circuit theory is an example of a deterministic mathematical model. Circuit theory models the interconnection of electronic devices by ideal circuits that consist of discrete components with idealized voltage-current characteristics. The theory assumes that the interaction between these idealized components is completely described by Kirchhoff’s voltage and current laws. For example, Ohm’s law states that the voltage-current characteristic of a resistor is The voltages and currents in any circuit consisting of an interconnection of batteries and resistors can be found by solving a system of simultaneous linear equations that is found by applying Kirchhoff’s laws and Ohm’s law. If an experiment involving the measurement of a set of voltages is repeated a number of times under the same conditions, circuit theory predicts that the observations will always be exactly the same. In practice there will be some variation in the observations due to measurement errors and uncontrolled factors. Nevertheless, this deterministic model will be adequate as long as the deviation about the predicted values remains small.\n\nPROBABILITY MODELS\nMany systems of interest involve phenomena that exhibit unpredictable variation and randomness.We define a random experiment to be an experiment in which the outcome varies in an unpredictable fashion when the experiment is repeated under the same conditions. Deterministic models are not appropriate for random experiments since they predict the same outcome for each repetition of an experiment. In this section we introduce probability models that are intended for random experiments. As an example of a random experiment, suppose a ball is selected from an urn containing three identical balls, labeled 0, 1, and 2.The urn is first shaken to randomize the position of the balls, and a ball is then selected.The number of the ball is noted, and the ball is then returned to the urn. The outcome of this experiment is a number from the set We call the set S of all possible outcomes the sample space. Figure 1.2 shows the outcomes in 100 repetitions (trials) of a computer simulation of this urn experiment. It is clear that the outcome of this experiment cannot consistently be predicted correctly.\n\nStatistical Regularity\nIn order to be useful, a model must enable us to make predictions about the future behavior of a system, and in order to be predictable, a phenomenon must exhibit regularity in its behavior. Many probability models in engineering are based on the fact that averages obtained in long sequences of repetitions (trials) of random experiments consistently yield approximately the same value. This property is called statistical regularity.\n\nSometimes we are interested in the occurrence of events associated with the outcomes of an experiment. For example, consider the event “an even-numbered ball is selected” in the above urn experiment.What is the relative frequency of this event? The event will occur whenever the number of the ball is 0 or 2.\n\nA DETAILED EXAMPLE: A PACKET VOICE TRANSMISSION SYSTEM\nIn the beginning of this chapter we claimed that probability models provide a tool that enables the designer to successfully design systems that must operate in a random environment, but that nevertheless are efficient, reliable, and cost effective. In this section, we present a detailed example of such a system. Our objective here is to convince you of the power and usefulness of probability theory. The presentation intentionally draws upon your intuition. Many of the derivation steps that may appear nonrigorous now will be made precise later in the book. Suppose that a communication system is required to transmit 48 simultaneous conversations from site A to site B using “packets” of voice information.The speech of each speaker is converted into voltage waveforms that are first digitized (i.e., converted into a sequence of binary numbers) and then bundled into packets of information that correspond to 10-millisecond (ms) segments of speech. A source and destination address is appended to each voice packet before it is transmitted (see Fig. 1.5). The simplest design for the communication system would transmit 48 packets every 10 ms in each direction. This is an inefficient design, however, since it is known that on the average about 2/3 of all packets contain silence and hence no speech information. In other words, on the average the 48 speakers only produce about active (nonsilence) packets per 10-ms period.We therefore consider another system that transmits only packets every 10 ms. Every 10 ms, the new system determines which speakers have produced packets with active speech. Let the outcome of this random experiment be A, the number of active packets produced in a given 10-ms segment. The quantity A takes on values in the range from 0 (all speakers silent) to 48 (all speakers active). If then all the active packets are transmitted. However, if then the system is unable to transmit all the active packets, so of the active packets are selected at random and discarded. The discarding of active packets results in the loss of speech, so we would like to keep the fraction of discarded active packets at a level that the speakers do not find objectionable.\n"
}